InformationRegisters/Письма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Письма</Name>
			<Comment>Почтовые сообщения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время прочтения писмьма приложением</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было отправлено письмо или адрес отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки письма</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяПочтовогоЯщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>MessageID почтового сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Письма/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Функция ПолучиИденитификаторыПрочитанныхКромеТребуемого(MessageID)
	//возвращает массив идентификаторов почтовых сообщений из регистра сведений, кроме заданного в аргументе
	
	MessageIDs = Новый Массив();
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = MessageIDs;
	
	Доступно = 		ТипЗнч(MessageID) = Тип("Строка")
				И 	ЗначениеЗаполнено(MessageID);
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ Т.Сигнатура КАК Сигнатура ИЗ РегистрСведений.Письма КАК Т ГДЕ НЕ Т.Сигнатура ПОДОБНО &MessageID");
	Запрос.УстановитьПараметр("MessageID", "%"+MessageID+"%");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
		
КонецФункции

&НаКлиенте
Процедура УдалитьСПочтовогоСервера(Команда)
	ВыполнитьВФоне = Истина;
	Если ВыполнитьВФоне Тогда
		//Сформируй идентификатор фонового задания и сохрани его в списке всех идентификаторов фоновых заданий
		//----------------------------------------------------------------------------------------------------
		ИдФонЗадания = Новый УникальныйИдентификатор();
		
		//Выполни фоновое задание
		//----------------------------------------------------------------------------------------------------------------
		ПараметрыФЗ = Новый Массив();
		ПараметрыФЗ.Добавить(ЭтаФорма.Запись.Сигнатура);
		ФоновыеЗадания_Выполнить("ЭлПочта.УдалитьСообщение" , ПараметрыФЗ, ИдФонЗадания, "Удаление почтового сообщения"); 
	Иначе
		ЭлПочта.УдалитьСообщение(ЭтаФорма.Запись.Сигнатура);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФоновыеЗадания_Выполнить(ИмяМетода, Параметры, Ключ, Наименование)
		ФоновыеЗадания.Выполнить(ИмяМетода, Параметры, Ключ, Наименование); 	
КонецФункции //</02.05.2017>


&НаКлиенте
Процедура ОткрытьПисьмо(Команда)
	
	//Найти входящее письмо
	Письмо	= ЭлПочтаКлиентСервер.ПисьмоНайти(Запись.Сигнатура, Запись.ИмяПользователяПочтовогоЯщика, Запись.АдресОтправителя, Запись.ДатаОтправки);
	
	Если Письмо.ИдентификаторСообщения <> Запись.Сигнатура Тогда
		Сообщить(СтрШаблон("Не найдено почтовое сообщение. Идентификатор сообщения (message id) = %1 ", Запись.Сигнатура));
		Возврат;
	КонецЕсли;
	
	//Открыть форму исходящего письма с пересылкой входящего
	ЭлПочтаКлиент.ПисьмоПереслать(Письмо, Запись.АдресПолучателя);
КонецПроцедуры

&НаКлиенте
Процедура ПокажиПисьмоВБраузере1(MessageID, PostingDate)
	
	Доступно = ТипЗнч(MessageID) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(MessageID);
	Доступно = Доступно И ТипЗнч(PostingDate) = Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(PostingDate);
	
	Если Не Доступно Тогда
		Возврат
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;		
	Профиль.АдресСервераPOP3 		= "mail.luidorauto.ru";
	Профиль.ПортPOP3				= 110;
	Профиль.ИспользоватьSSLPOP3 	= Ложь;
	Профиль.Пользователь			= "LuidorUser160@main.luidorauto.ru";
	Профиль.Пароль 					= "luidor1423";
	ТекПротокол 					= ПротоколИнтернетПочты.POP3;
	
	Попытка 
		Почта.Подключиться(Профиль,ТекПротокол);	
	Исключение
		СтрСобытия = Новый Структура;
		СтрСобытия.Вставить("СобытиеИмя","ПисьмаЗагрузить");
		СтрСобытия.Вставить("СобытиеКомментарий","Ошибка при подключении к почтовому серверу: " + СокрЛП(ОписаниеОшибки()));
		ОбщегоНазначения.ЗаписатьСобытие(СтрСобытия);
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// Получим все почтовые сообщения
	Попытка
		Если ТекПротокол = ПротоколИнтернетПочты.POP3 Тогда // Протокол не позволяет фильтровать сообщения
			МассивСообщений = Почта.Выбрать(Ложь, , Истина);			
		ИначеЕсли ТекПротокол = ПротоколИнтернетПочты.IMAP Тогда
			// Параметры отбора работают только для IMAP
			
			ПарамОтбора = Новый Структура();
			ПарамОтбора.Вставить("ДатаОтправления", PostingDate);
			//ПараметрыОтбора.Вставить("MessageID", MessageID);
			//ПарамОтбора.Вставить("Прочитанные", Истина);
			//ПарамОтбора.Вставить("Новые", Истина);
			
			МассивИдентификаторовСообщений = Новый Массив();
			//МассивИдентификаторовСообщений.Добавить(MessageID);
			
			//чтобы получить только новые сообщения нужно передать идентификаторы уже прочитанных сообщений - не делаю этого
			МассивUID = Почта.ПолучитьИдентификаторы(МассивИдентификаторовСообщений, ПарамОтбора);
			МассивСообщений = Почта.Выбрать(Ложь, МассивUID, Ложь);
		КонецЕсли;
		Почта.Отключиться();
	Исключение
		СтрСобытия = Новый Структура;
		СтрСобытия.Вставить("СобытиеКомментарий","Ошибка при выборке почтовых сообщений: " + СокрЛП(ОписаниеОшибки()));
		ОбщегоНазначения.ЗаписатьСобытие(СтрСобытия);
		Возврат;
	КонецПопытки;
	
	Если МассивСообщений.Количество()=0 Тогда
		Возврат
	КонецЕсли;
	
	НайденоПисьмо = Ложь;
	Для Каждого Письмо Из МассивСообщений Цикл
		Если Письмо.ИдентификаторСообщения <> MessageID Тогда
			Продолжить
		КонецЕсли;
		НайденноеПисьмо = Письмо;
		НайденоПисьмо = Истина;
		Прервать;
	КонецЦикла;
	Если Не НайденоПисьмо Тогда
		Возврат
	КонецЕсли;
	
	Позиция_At = СтрНайти(MessageID, "@");
	Если Позиция_At>0 Тогда
		ИмяФайла = Лев(MessageID, Позиция_At-1)+".html";
	Иначе
		ИмяФайла = "Письмо.html";
	КонецЕсли;
	
	ТекстДок =  Новый ТекстовыйДокумент;
	ПолноеИмяФайла = КаталогВременныхФайлов()+ ИмяФайла;
	ТекстДок.ИспользуемоеИмяФайла=(ПолноеИмяФайла);
	Раздел = "<html><body>";
	ТекстДок.ДобавитьСтроку(Раздел);
	Раздел = "";
	
	//Для вывода в браузер оставим только  тексты типа html
	Для Каждого СтрокаТекста Из НайденноеПисьмо.Тексты Цикл
		//Если Не СтрокаТекста.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда
		//	Продолжить
		//КонецЕсли;
		Раздел=Раздел + "<div>"+СтрокаТекста.Текст+"</div>";
	КонецЦикла;
	
	Раздел = Раздел+"</body></html>";
	ТекстДок.ДобавитьСтроку(Раздел);
	
	Попытка 
		ТекстДок.Записать(ПолноеИмяФайла);
	Исключение
		ПоказатьПредупреждение(,"Ошибка сохранения файла "+ПолноеИмяФайла,,3);
		Возврат;
	КонецПопытки;	
	
	Попытка
		ЗапуститьПриложение(ПолноеИмяФайла);	
	Исключение
		ПоказатьПредупреждение(,"Ошибка открытия файла "+ПолноеИмяФайла,,3);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПисьмо3(Команда)
	//Найти входящее письмо
	Письмо	= ЭлПочтаКлиентСервер.ПисьмоНайти(Запись.Сигнатура, Запись.ИмяПользователяПочтовогоЯщика, Запись.АдресОтправителя, Запись.ДатаОтправки);
	
	Если Письмо.ИдентификаторСообщения <> Запись.Сигнатура Тогда
		Сообщить(СтрШаблон("Не найдено почтовое сообщение. Идентификатор сообщения (message id) = %1 ", Запись.Сигнатура));
		Возврат;
	КонецЕсли;
	
	//Открыть форму исходящего письма с пересылкой входящего
	//ЭлПочтаКлиент.ПисьмоПереслать2(Письмо, Запись.АдресПолучателя);
	ПисьмоПереслать2(Письмо, Запись.АдресПолучателя);
КонецПроцедуры


&НаКлиенте
Функция ПисьмоПереслать2(Письмо, АдресОтвета )
	//Пересылает входящее письмо (параметр Письмо)
	Доступно = 		ТипЗнч(Письмо) 		= Тип("ИнтернетПочтовоеСообщение")
				И	ТипЗнч(АдресОтвета) = Тип("Строка")
				И	ЗначениеЗаполнено(АдресОтвета);
	Если Не Доступно Тогда
		Возврат "ошибка"
	КонецЕсли;
	
	//Получи вложения
	Вложения = Новый СписокЗначений();
	Для Каждого i Из Письмо.Вложения Цикл
		//Исключи из вложений - вложенные почтовые сообщения, не получается пока их обработать корректно
		Если ТипЗнч(i.Данные) = Тип("ИнтернетПочтовоеСообщение") Тогда
			Продолжить;
		КонецЕсли;
		Вложения.Добавить(i.Данные, i.ИмяФайла);	
	КонецЦикла;
	
	//Получи идентификаторы вложений
	ВложенияИдентификаторы = Новый СписокЗначений();
	Для Каждого i Из Письмо.Вложения Цикл
		//Исключи из вложений - вложенные почтовые сообщения, не получается пока их обработать корректно
		Если ТипЗнч(i.Данные) = Тип("ИнтернетПочтовоеСообщение") Тогда
			Продолжить;
		КонецЕсли;
		ВложенияИдентификаторы.Добавить(Новый Структура("Идентификатор, Данные, ТипСодержимого, ИмяФайла", i.Идентификатор, i.Данные, i.ТипСодержимого, i.ИмяФайла), i.Идентификатор);	
	КонецЦикла;

	
	//Сформируй из полученного письма тело, включая шапку from,send,to,subject
	Отправитель 	= ?(ТипЗнч(Письмо.Отправитель) = Тип("ИнтернетПочтовыйАдрес"), Письмо.Отправитель.Адрес, Письмо.Отправитель);
	Отправлено		= Письмо.ДатаОтправления;
	Получатели = "";
	Для Каждого i Из Письмо.Получатели Цикл
		Получатели = Получатели + ?(ЗначениеЗаполнено(Получатели), ",", "") + i.Адрес;
	КонецЦикла;
	Тема = Письмо.Тема;
			
	Тело = "";
	Для Каждого i Из Письмо.Тексты Цикл
		Тело = Тело + i.Текст;	
	КонецЦикла; 
	
	//По некоторым письмам от no-reply@perx.ru текст в теле письма записан дважды: простой текст и текст HTML. Берем только текст HTML
	Если Письмо.Тексты.Количество()>=2 Тогда
		Тело = Письмо.Тексты[1].Текст;	
	КонецЕсли;
	
	ПС = "";
	Тело ="<html>-----------------------------------"+ПС+"<div><b>From:</b> "+Отправитель+"</div>"+ПС+"<div><b>Sent:</b> "+Отправлено+"</div>"+ПС+"<div><b>To:</b> "+Получатели+"</div>"+ПС+"<div><b>Subject:</b> "+Тема+"</div><div> </div></html>"+ПС+ПС+Тело;	
	
	Парам = Новый Структура();
	Парам.Вставить("АдресОтвета",				"ekc@luidor.ru");
	Парам.Вставить("Тема",						СтрШаблон("FW:%1", Письмо.Тема));
	Парам.Вставить("Тело",						Тело);
	Парам.Вставить("Вложения", 					Вложения);
	Парам.Вставить("ВходящееПисьмоОснование",	Письмо.ИдентификаторСообщения);
	Парам.Вставить("ВложенияИдентификаторы",	ВложенияИдентификаторы);
	ОткрытьФорму("ОбщаяФорма.ОтправкаПочтовогоСообщения4", Парам,,,,,);
		
КонецФункции
